---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MechanicalSystem.SystemType
source: html/9cca58c6-5cc0-dd3a-6bf7-73e48de6cefc.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalSystem.SystemType Property

The type of this duct system.

## Syntax (C#)
```csharp
public DuctSystemType SystemType { get; }
```